kbreddiee/octokey/firmware/hub-dongle/sdkconfig.defaults
# espkvm hub-dongle — LILYGO T-Dongle-S3, or any ESP32-S2/S3 stick with
# native USB. The dongle that doubles as the hub: USB HID to its own
# computer (local slot), Wi-Fi AP + phone web UI, ESP-NOW to the other
# dongles.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 1 ms tick for snappy input handling
CONFIG_FREERTOS_HZ=1000

# Latency over size
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# HKDF for pairing key derivation (off by default in IDF)
CONFIG_MBEDTLS_HKDF_C=y

# ESP-NOW supports at most 6-7 encrypted peers by default; we need 10
# dongles + the broadcast pseudo-peer.
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=14

# Two TinyUSB HID instances: boot keyboard + (mouse/consumer)
CONFIG_TINYUSB_HID_COUNT=2

# Room for the embedded web app + a few JSON messages in flight
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_WS_SUPPORT=y

# OctoKey branding: the Wi-Fi network the phone joins. Change the password
# before using anywhere shared (see docs/SECURITY.md).
CONFIG_ESPKVM_AP_SSID="octokey"
CONFIG_ESPKVM_AP_PASSWORD="octokey-air"
